<a href="https://colab.research.google.com/github/Avinashvns/pandas_practice/blob/main/Pandas_Practice/GroupBy_Aggregation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

üëâ Data ‡§ï‡•ã groups ‡§Æ‡•á‡§Ç ‡§¨‡§æ‡§Å‡§ü‡§®‡§æ
‡§î‡§∞ ‡§´‡§ø‡§∞ ‡§π‡§∞ group ‡§™‡§∞ calculation ‡§ï‡§∞‡§®‡§æ

In [1]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Ali", "Rohit", "Neha", "Amit", "Sara", "John"],
    "Dept": ["IT", "HR", "IT", "Sales", "HR", "Sales"],
    "Salary": [50000, 40000, 55000, 60000, 42000, 58000],
    "Age": [21, 25, 20, 23, 22, 24]
})

print(df)

    Name   Dept  Salary  Age
0    Ali     IT   50000   21
1  Rohit     HR   40000   25
2   Neha     IT   55000   20
3   Amit  Sales   60000   23
4   Sara     HR   42000   22
5   John  Sales   58000   24

## 1Ô∏è‚É£ Basic GroupBy

### ‚úÖ Department wise average salary

In [2]:
df.groupby("Dept")["Salary"].mean()

Dept
HR       41000.0
IT       52500.0
Sales    59000.0
Name: Salary, dtype: float64

## 2Ô∏è‚É£ GroupBy with Sum
###‚úÖ Total salary per department

In [3]:
df.groupby("Dept")["Salary"].sum()

Dept
HR        82000
IT       105000
Sales    118000
Name: Salary, dtype: int64

## 3Ô∏è‚É£ GroupBy with Count
###‚úÖ ‡§ï‡§ø‡§§‡§®‡•á employees ‡§π‡•à‡§Ç ‡§π‡§∞ dept ‡§Æ‡•á‡§Ç?

In [4]:
df.groupby("Dept")["Name"].count()

Dept
HR       2
IT       2
Sales    2
Name: Name, dtype: int64

# 4Ô∏è‚É£ Multiple Aggregations (Real Analyst Style)

In [5]:
df.groupby("Dept")["Salary"].agg(["mean","max","min","sum"])

          mean    max    min     sum
Dept
HR     41000.0  42000  40000   82000
IT     52500.0  55000  50000  105000
Sales  59000.0  60000  58000  118000

## 5Ô∏è‚É£ GroupBy on Multiple Columns
###Dept + Age wise salary mean

In [7]:
df.groupby(["Dept" , "Age"])['Salary'].mean()

Dept   Age
HR     22     42000.0
       25     40000.0
IT     20     55000.0
       21     50000.0
Sales  23     60000.0
       24     58000.0
Name: Salary, dtype: float64

## Department wise average age ‡§®‡§ø‡§ï‡§æ‡§≤‡•ã

In [8]:
df.groupby("Dept")["Age"].mean()

Dept
HR       23.5
IT       20.5
Sales    23.5
Name: Age, dtype: float64

# Department wise maximum salary ‡§®‡§ø‡§ï‡§æ‡§≤‡•ã

In [9]:
df.groupby("Dept")["Salary"].max()

Dept
HR       42000
IT       55000
Sales    60000
Name: Salary, dtype: int64

# ‡§π‡§∞ department ‡§Æ‡•á‡§Ç ‡§ï‡§ø‡§§‡§®‡•á ‡§≤‡•ã‡§ó ‡§π‡•à‡§Ç?

In [10]:
df.groupby("Dept")["Name"].count()

Dept
HR       2
IT       2
Sales    2
Name: Name, dtype: int64

# ‡§∏‡§¨‡§∏‡•á ‡§ú‡•ç‡§Ø‡§æ‡§¶‡§æ average salary ‡§ï‡§ø‡§∏ dept ‡§Æ‡•á‡§Ç ‡§π‡•à?

In [12]:
df.groupby("Dept")["Salary"].mean().idxmax()

'Sales'